app/Controllers/Customer.php

    public function add()
    {
        $validation = \Config\Services::validation();

        if ($this->request->getMethod() === 'post') {
            $validation->setRules([
                'company' => 'required',
                'primaryEmail' => 'required|valid_email',
                'phoneNumber' => 'required',
                'city' => 'required',
                'state' => 'required',
                'zipCode' => 'required',
                'country' => 'required',
            ]);

            if ($validation->withRequest($this->request)->run()) {
                try {
                    $accountData = $this->getAccountDataFromRequest();
                    $this->customerModel->insert($accountData);
---
INSERT INTO `customers` (`company_name`, `primary_email`, `phone_number`, `website`, `city`, `state`, `zipcode`, `country`, `created_at`, `updated_at`) VALUES ('Company', 'mubee@gmail.com', '12345', 'https://www.example.com', 'Ikeja', 'Lagos', '1234', 'Nigeria', '2024-02-18 10:46:27', '2024-02-18 10:46:27')