app/Controllers/TaskController.php

    public function viewTasks()
    {
        try {
            $this->refreshApiKey();
            $tasks = $this->getZohoTasks();
            $customerModel = new \App\Models\CustomerModel();
            $customers = $customerModel->findAll();
---
SELECT *
FROM `customers`

    public function add()
    {
        $validation = \Config\Services::validation();

        if ($this->request->getMethod() === 'post') {
            $validation->setRules([
                'customers' => 'required|is_array',
                'taskName' => 'required',
                'hourlyRate' => 'required',
                'startDate' => 'required',
                'dueDate' => 'required',
                'priority' => 'required',
                'relatedTo' => 'required',
                'taskDescription' => 'required',
            ]);

            if ($validation->withRequest($this->request)->run()) {
                $taskData = $this->getTaskDataFromRequest();
                $this->taskModel->insert($taskData);
---
INSERT INTO `tasks` (`name`, `hourly_rate`, `start_date`, `due_date`, `priority`, `related_to`, `task_description`, `created_at`, `updated_at`) VALUES ('Mubarak\'s task', '202', '48', '24', 'Medium', 'Medium', 'Test', '2024-02-18 10:56:35', '2024-02-18 10:56:35')